const partnersList = document.querySelectorAll('.offers__faq_dropdown-active')
const partnersListBtn = document.querySelectorAll('.offers__faq_dropdown_btn')
const dropdownContent = document.querySelectorAll('.dropdown__content')
const dropdownData = ['Акция публичной компании — это доля в бизнесе. Чтобы понять, сколько она должна стоить, нужно оценить, как скоро вложения в конкретного эмитента окупятся. С одной стороны, компания может вернуть инвестору деньги только одним способом: поделиться прибылью, то есть, заплатить дивиденды.С другой стороны, помимо выплаты дивидендов, компания может направить свою прибыль на развитие бизнеса. Тогда финансовые показатели эмитента могут улучшиться, и его акции подорожают. В любом случае вы или сразу вернете часть денег, или ваша доля подорожает.Если вы разом купите все акции ВТБ по нынешней цене и его годовая прибыль не изменится — значит вам понадобится примерно 13 годовых прибылей, чтобы вложение окупилось. Или, другими словами, 13 лет. Если на таких же условиях купить «Норникель» — он окупится примерно через 10 лет. Выходит, по соотношению цена/прибыль акция «Норникеля» за 11 000 рублей выгоднее, чем акция ВТБ за 5 копеек.Формулы для такой оценки акций называются мультипликаторами. Это производные показатели, которые отражают соотношение между финансовыми результатами компании (прибыль, выручка, долги, капитал) и ее капитализацией.Или, другими словами, 13 лет. Если на таких же условиях купить «Норникель» — он окупится примерно через 10 лет. Выходит, по соотношению цена/прибыль акция «Норникеля» за 11 000 рублей выгоднее, чем акция ВТБ за 5 копеек.Формулы для такой оценки акций называются мультипликаторами. Это производные показатели, которые отражают с', 
'Акция публичной компании — это доля в бизнесе. Чтобы понять, сколько она должна стоить, нужно оценить, как скоро вложения в конкретного эмитента окупятся. С одной стороны, компания может вернуть инвестору деньги только одним способом: поделиться прибылью, то есть, заплатить дивиденды.С другой стороны, помимо выплаты дивидендов, компания может направить свою прибыль на развитие бизнеса. Тогда финансовые показатели эмитента могут улучшиться, и его акции подорожают. В любом случае вы или сразу вернете часть денег, или ваша доля подорожает.Если вы разом купите все акции ВТБ по нынешней цене и его годовая прибыль не изменится — значит вам понадобится примерно 13 годовых прибылей, чтобы вложение окупилось. Или, другими словами, 13 лет. Если на таких же условиях купить «Норникель» — он окупится примерно через 10 лет. Выходит, по соотношению цена/прибыль акция «Норникеля» за 11 000 рублей выгоднее, чем акция ВТБ за 5 копеек.Формулы для такой оценки акций называются мультипликаторами. Это производные показатели, которые отражают соотношение между финансовыми результатами компании (прибыль, выручка, долги, капитал) и ее капитализацией.Или, другими словами, 13 лет. Если на таких же условиях купить «Норникель» — он окупится примерно через 10 лет. Выходит, по соотношению цена/прибыль акция «Норникеля» за 11 000 рублей выгоднее, чем акция ВТБ за 5 копеек.Формулы для такой оценки акций называются мультипликаторами. ', 
'Акция публичной компании — это доля в бизнесе. Чтобы понять, сколько она должна стоить, нужно оценить, как скоро вложения в конкретного эмитента окупятся. С одной стороны, компания может вернуть инвестору деньги только одним способом: поделиться прибылью, то есть, заплатить дивиденды.С другой стороны, помимо выплаты дивидендов, компания может направить свою прибыль на развитие бизнеса. Тогда финансовые показатели эмитента могут улучшиться, и его акции подорожают. В любом случае вы или сразу вернете часть денег, или ваша доля подорожает.Если вы разом купите все акции ВТБ по нынешней цене и его годовая прибыль не изменится — значит вам понадобится примерно 13 годовых прибылей, чтобы вложение окупилось. Или, другими словами, мулы для такой оценки акций называются мультипликаторами. Это производные показатели, которые отражают соотношение между финансовыми результатами компании (прибыль, выручка, долги, капитал) и ее капитализацией.Или, другими словами, 13 лет. Если на таких же условиях купить «Норникель» — он окупится примерно через 10 лет. Выходит, по соотношению цена/прибыль акция «Норникеля» за 11 000 рублей выгоднее, чем акция ВТБ за 5 копеек.Формулы для такой оценки акций называются мультипликаторами. Это производные показатели, которые отражают с', 
'Акция публичной компании — это доля в бизнесе. Чтобы понять, сколько она должна стоить, нужно оценить, как скоро вложения в конкретного эмитента окупятся. С одной стороны, компания может вернуть инвестору деньги только одним способом: поделиться прибылью, то есть, заплатить дивиденды.С другой стороны, помимо выплаты дивидендов, компания и, другими словами, 13 лет. Если на таких же условиях купить «Норникель» — он окупится примерно через 10 лет. Выходит, по соотношению цена/прибыль акция «Норникеля» за 11 000 рублей выгоднее, чем акция ВТБ за 5 копеек.Формулы для такой оценки акций называются мультипликаторами. Это производные показатели, которые отражают соотношение между финансовыми результатами компании (прибыль, выручка, долги, капитал) и ее капитализацией.Или, другими словами, 13 лет. Если на таких же условиях купить «Норникель» — он окупится примерно через 10 лет. Выходит, по соотношению цена/прибыль акция «Норникеля» за 11 000 рублей выгоднее, чем акция ВТБ за 5 копеек.Формулы для такой оценки акций называются мультипликаторами. Это производные показатели, которые отражают с', 
'Акция публичной компании — это доля в бизнесе. Чтобы понять, сколько она должна стоить, нужно оценить, как скоро вложения в конкретного эмитента окупятся. С одной стороны, компания может вернуть инвестору деньги только одним способом: поделиться прибылью, то есть, заплатить дивиденды.С другой стороны, помимо выплаты дивидендов, компания может направить свою прибыль на развитие бизнеса. Тогда финансовые показатели эмитента могут улучшиться, и его акции подорожают. В любом случае вы или сразу ветношению цена/прибыль акция «Норникеля» за 11 000 рублей выгоднее, чем акция ВТБ за 5 копеек.Формулы для такой оценки акций называются мультипликаторами. Это производные показатели, которые отражают соотношение между финансовыми результатами компании (прибыль, выручка, долги, капитал) и ее капитализацией.Или, другими словами, 13 лет. Если на таких же условиях купить «Норникель» — он окупится примерно через 10 лет. Выходит, по соотношению цена/прибыль акция «Норникеля» за 11 000 рублей выгоднее, чем акция ВТБ за 5 копеек.Формулы для такой оценки акций называются мультипликаторами. Это производные показатели, которые отражают с', 
'Акция публичной компании — это доля в бизнесе. Чтобы понять, сколько она должна стоить, нужно оценить, как скоро вложения в конкретного эмитента окупятся. С одной стороны, компания может вернуть инвестору деньги только одним способом: поделиться прибылью, то есть, заплатить дивиденды.С другой стороны, помимо выплаты дивидендов, компания может направить свою прибыль на развитие бизнеса. Тогда финансовые показатели эмитента могут улучшиться, и его акции подорожают. В любом случае вы или сразу вернете часть денег, или ваша доля подорожает.Еслижду финансовыми результатами компании (прибыль, выручка, долги, капитал) и ее капитализацией.Или, другими словами, 13 лет. Если на таких же условиях купить «Норникель» — он окупится примерно через 10 лет. Выходит, по соотношению цена/прибыль акция «Норникеля» за 11 000 рублей выгоднее, чем акция ВТБ за 5 копеек.Формулы для такой оценки акций называются мультипликаторами. Это производные показатели, которые отражают с', 
'Акция публичной компании — это доля в бизнесе. Чтобы понять, сколько она должна стоить, нужно оценить, как скоро вложения в конкретного эмитента окупятся. С одной стороны, компания может вернуть инвестору деньги только одним способом: поделиться прибылью, то есть, заплатить дивиденды.С другой стороны, помимо выплаты дивидендов, компания может направить свою прибыль на развитие бизнеса. Тогда финансовые показатели эмитента могут улучшиться, и его акции подорожают. В любом случае вы или сразу вернете часть денег, или ваша доля подорожает.Если вы разом купите все акции ВТБ по нынешней цене и его годовая прибыль не изменится — значит вам понадовами, 13 лет. Если на таких же условиях купить «Норникель» — он окупится примерно через 10 лет. Выходит, по соотношению цена/прибыль акция «Норникеля» за 11 000 рублей выгоднее, чем акция ВТБ за 5 копеек.Формулы для такой оценки акций называются мультипликаторами. Это производные показатели, которые отражают с', 
'Акция публичной компании — это доля в бизнесе. Чтобы понять, сколько она должна стоить, нужно оценить, как скоро вложения в конкретного эмитента окупятся. С одной стороны, компания может вернуть инвестору деньги только одним способом: поделиться прибыльюких же условиях купить «Норникель» — он окупится примерно через 10 лет. Выходит, по соотношению цена/прибыль акция «Норникеля» за 11 000 рублей выгоднее, чем акция ВТБ за 5 копеек.Формулы для такой оценки акций называются мультипликаторами. Это производные показатели, которые отражают соотношение между финансовыми результатами компании (прибыль, выручка, долги, капитал) и ее капитализацией.Или, другими словами, 13 лет. Если на таких же условиях купить «Норникель» — он окупится примерно через 10 лет. Выходит, по соотношению цена/прибыль акция «Норникеля» за 11 000 рублей выгоднее, чем акция ВТБ за 5 копеек.Формулы для такой оценки акций называются мультипликаторами. Это производные показатели, которые отражают с', 
'Акция публичной компании — это доля в бизнесе. Чтобы понять, сколько т улучшиться, и его акции подорожают. В любом случае вы или сразу вернете часть денег, или ваша доля подорожает.Если вы разом купите все акции ВТБ по нынешней цене и его годовая прибыль не изменится — значит вам понадобится примерно 13 годовых прибылей, чтобы вложение окупилось. Или, другими словами, 13 лет. Если на таких же условиях купить «Норникель» — он окупится примерно через 10 лет. Выходит, по соотношению цена/прибыль акция «Норникеля» за 11 000 рублей выгоднее, чем акция ВТБ за 5 копеек.Формулы для такой оценки акций называются мультипликаторами. Это производные показатели, которые отражают соотношение между финансовыми результатами компании (прибыль, выручка, долги, капитал) и ее капитализацией.Или, другими словами, 13 лет. Если на таких же условиях купить «Норникель» — он окупится примерно через 10 лет. Выходит, по соотношению цена/прибыль акция «Норникеля» за 11 000 рублей выгоднее, чем акция ВТБ за 5 копеек.Формулы для такой оценки акций называются мультипликаторами. Это производные показатели, которые отражают с', 
'Акция публичной компании — это доля в бизнесе. Чтобы понять, сколько она должна стоить, нужно оценить, как скоро вложения в конкретного эмитента окупятся. С одной стороны, компания может вернуть инвестору деньги только одним способом: поделиться прибылью, то есть, заплатить дивиденды.С другой стороны, помимо выплаты дивидендов, компания может направить свою прибыль на развитие бизнеса. Тогда финансовые показатели эмитента могут улучшиться, и его акции подорожают. В любом случае вы или сразу вернете часть денег, или ваша доля подорожает.Если вы разом купите все акции ВТБ по нынешней цене и его годовая прибыль не изменится — значИли, другими словами, 13 лет. Если на таких же условиях купить «Норникель» — он окупится примерно через 10 лет. Выходит, по соотношению цена/прибыль акция «Норникеля» за 11 000 рублей выгоднее, чем акция ВТБ за 5 копеек.Формулы для такой оценки акций называются мультипликаторами. Это производные показатели, которые отражают с']
const contentText = document.querySelector('.dropdown__content_text')
const textDeposits = document.getElementById('partners__text-one')
const copyDeposits = document.getElementById('partners__text_btn-one')
const textCredit = document.getElementById('partners__text-two')
const copyCredit = document.getElementById('partners__text_btn-two')
const textCrypt = document.getElementById('partners__text-three')
const copyCrypt = document.getElementById('partners__text_btn-three')
const success = document.querySelector('.copy-confirmation')
const successTwo = document.querySelector('.copy-confirmation-two')
const successThree = document.querySelector('.copy-confirmation-three')

const copyBank = document.getElementById('btn__bank') 
const copyBankCredit = document.getElementById('btn__bank_credit')
const copyLoans = document.getElementById('btn__loans')
const textBank = document.getElementById('bank')   
const textBankCredit = document.getElementById('bank__credit')
const textLoans = document.getElementById('loans')
const successBank = document.querySelector('.copy-confirmation-bank')
const successBankCredit = document.querySelector('.copy-confirmation-bank__credit')
const successLoans = document.querySelector('.copy-confirmation-loans')

const btnFirst = document.getElementById('btn__first') 
const btnSecond = document.getElementById('btn__second')
const btnThird = document.getElementById('btn__third')
const codeFirst = document.getElementById('copy__code_first')   
const codeSecond = document.getElementById('copy__code_second')
const codeThird = document.getElementById('copy__code_third')
const successFirst = document.querySelector('.copy-confirmation-first')
const successSecond = document.querySelector('.copy-confirmation-second')
const successThird = document.querySelector('.copy-confirmation-third')

partnersListBtn.forEach((arrow, index) => {
    arrow.addEventListener('click', (e) => {
        e.currentTarget.classList.toggle('offers__faq_dropdown_btn')
        partnersList.forEach((table, ind) => {
            if (index === ind) table.classList.toggle('offers__faq_dropdown-active')
        })
    })
})

dropdownContent.forEach((item, index) => {
    item.addEventListener('click', () => {
        dropdownContent.forEach(i => {
            i.classList.remove('dropdown__active');
        });
        dropdownContent[index].classList.add('dropdown__active');
        contentText.textContent = dropdownData[index]
    })

})

copyDeposits.addEventListener('click', function() {
    textDeposits.select();
    textDeposits.setSelectionRange(0, 99999);
    document.execCommand('copy')
    success.classList.add('copy-confirmation_active')
    setTimeout(function(){
        success.classList.remove('copy-confirmation_active')
    }, 1000)

    console.log('copy successful')
})

copyCredit.addEventListener('click', function() {
    textCredit.select()
    textCredit.setSelectionRange(0, 99999)
    document.execCommand('copy')
    successTwo.classList.add('copy-confirmation-two_active')
    setTimeout(function(){
        successTwo.classList.remove('copy-confirmation-two_active')
    }, 1000)
    
    console.log('copy successful')
})

copyCrypt.addEventListener('click', function() {
    textCrypt.select()
    textCrypt.setSelectionRange(0, 99999)
    document.execCommand('copy')
    successThree.classList.add('copy-confirmation-three_active')
    setTimeout(function(){
        successThree.classList.remove('copy-confirmation-three_active')
    }, 1000)
    
    console.log('copy successful')
})


copyBank.addEventListener('click', function() {
    textBank.select()
    textBank.setSelectionRange(0, 99999)
    document.execCommand('copy')
    successBank.classList.add('copy-confirmation-bank_active')
    setTimeout(function(){
        successBank.classList.remove('copy-confirmation-bank_active')
    }, 1000)

    console.log('copy successful')
})

copyBankCredit.addEventListener('click', function() {
    textBankCredit.select()
    textBankCredit.setSelectionRange(0, 99999)
    document.execCommand('copy')
    successBankCredit.classList.add('copy-confirmation-bank__credit_active')
    setTimeout(function(){
        successBankCredit.classList.remove('copy-confirmation-bank__credit_active')
    }, 1000)
    
    console.log('copy successful')
})

copyLoans.addEventListener('click', function() {
    textLoans.select()
    textLoans.setSelectionRange(0, 99999)
    document.execCommand('copy')
    successLoans.classList.add('copy-confirmation-loans_active')
    setTimeout(function(){
        successLoans.classList.remove('copy-confirmation-loans_active')
    }, 1000)
    
    console.log('copy successful')
})

btnFirst.addEventListener('click', function() {
    codeFirst.select()
    codeFirst.setSelectionRange(0, 99999)
    document.execCommand('copy')
    successFirst.classList.add('copy-confirmation-first_active')
    setTimeout(function(){
        successFirst.classList.remove('copy-confirmation-first_active')
    }, 1000)

    console.log('copy successful')
})

btnSecond.addEventListener('click', function() {
    codeSecond.select()
    codeSecond.setSelectionRange(0, 99999)
    document.execCommand('copy')
    successSecond.classList.add('copy-confirmation-second_active')
    setTimeout(function(){
        successSecond.classList.remove('copy-confirmation-second_active')
    }, 1000)
    
    console.log('copy successful')
})

btnThird.addEventListener('click', function() {
    codeThird.select()
    codeThird.setSelectionRange(0, 99999)
    document.execCommand('copy')
    successThird.classList.add('copy-confirmation-third_active')
    setTimeout(function(){
        successThird.classList.remove('copy-confirmation-third_active')
    }, 1000)
    
    console.log('copy successful')
})

try{
    const copyBtns = document.querySelectorAll('.copy-info');
const copyContent = document.querySelectorAll('.copy-block');

copyBtns.forEach((btn, index) => {
    btn.addEventListener('click', () => {
        copyContent[index].classList.add('copy-confirmation-referral_active')
        setTimeout(function(){
            copyContent[index].classList.remove('copy-confirmation-referral_active')
        }, 1000)
    })
})
} catch{}